Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/dacc.h
/*
 * Component description for DACC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-03-27T04:07:22Z */
#ifndef _SAMRH707_DACC_COMPONENT_H_
#define _SAMRH707_DACC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DACC                                         */
/* ************************************************************************** */

/* -------- DACC_CR : (DACC Offset: 0x00) ( /W 32) Control Register -------- */
#define DACC_CR_SWRST_Pos                     _UINT32_(0)                                          /* (DACC_CR) Software Reset Position */
#define DACC_CR_SWRST_Msk                     (_UINT32_(0x1) << DACC_CR_SWRST_Pos)                 /* (DACC_CR) Software Reset Mask */
#define DACC_CR_SWRST(value)                  (DACC_CR_SWRST_Msk & (_UINT32_(value) << DACC_CR_SWRST_Pos)) /* Assigment of value for SWRST in the DACC_CR register */
#define DACC_CR_Msk                           _UINT32_(0x00000001)                                 /* (DACC_CR) Register Mask  */


/* -------- DACC_MR : (DACC Offset: 0x04) (R/W 32) Mode Register -------- */
#define DACC_MR_TRGEN_Pos                     _UINT32_(0)                                          /* (DACC_MR) Trigger Enable Position */
#define DACC_MR_TRGEN_Msk                     (_UINT32_(0x1) << DACC_MR_TRGEN_Pos)                 /* (DACC_MR) Trigger Enable Mask */
#define DACC_MR_TRGEN(value)                  (DACC_MR_TRGEN_Msk & (_UINT32_(value) << DACC_MR_TRGEN_Pos)) /* Assigment of value for TRGEN in the DACC_MR register */
#define   DACC_MR_TRGEN_DIS_Val               _UINT32_(0x0)                                        /* (DACC_MR) External trigger mode disabled. DACC in free-running mode.  */
#define   DACC_MR_TRGEN_EN_Val                _UINT32_(0x1)                                        /* (DACC_MR) External trigger mode enabled.  */
#define DACC_MR_TRGEN_DIS                     (DACC_MR_TRGEN_DIS_Val << DACC_MR_TRGEN_Pos)         /* (DACC_MR) External trigger mode disabled. DACC in free-running mode. Position  */
#define DACC_MR_TRGEN_EN                      (DACC_MR_TRGEN_EN_Val << DACC_MR_TRGEN_Pos)          /* (DACC_MR) External trigger mode enabled. Position  */
#define DACC_MR_TRGSEL_Pos                    _UINT32_(1)                                          /* (DACC_MR) Trigger Selection Position */
#define DACC_MR_TRGSEL_Msk                    (_UINT32_(0x7) << DACC_MR_TRGSEL_Pos)                /* (DACC_MR) Trigger Selection Mask */
#define DACC_MR_TRGSEL(value)                 (DACC_MR_TRGSEL_Msk & (_UINT32_(value) << DACC_MR_TRGSEL_Pos)) /* Assigment of value for TRGSEL in the DACC_MR register */
#define   DACC_MR_TRGSEL_TRGSEL0_Val          _UINT32_(0x0)                                        /* (DACC_MR) External trigger  */
#define   DACC_MR_TRGSEL_TRGSEL1_Val          _UINT32_(0x1)                                        /* (DACC_MR) TIOA Output of the Timer Counter Channel 0  */
#define   DACC_MR_TRGSEL_TRGSEL2_Val          _UINT32_(0x2)                                        /* (DACC_MR) TIOA Output of the Timer Counter Channel 1  */
#define   DACC_MR_TRGSEL_TRGSEL3_Val          _UINT32_(0x3)                                        /* (DACC_MR) TIOA Output of the Timer Counter Channel 2  */
#define   DACC_MR_TRGSEL_TRGSEL4_Val          _UINT32_(0x4)                                        /* (DACC_MR) PWM Event Line 0  */
#define   DACC_MR_TRGSEL_TRGSEL5_Val          _UINT32_(0x5)                                        /* (DACC_MR) PWM Event Line 1  */
#define DACC_MR_TRGSEL_TRGSEL0                (DACC_MR_TRGSEL_TRGSEL0_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) External trigger Position  */
#define DACC_MR_TRGSEL_TRGSEL1                (DACC_MR_TRGSEL_TRGSEL1_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) TIOA Output of the Timer Counter Channel 0 Position  */
#define DACC_MR_TRGSEL_TRGSEL2                (DACC_MR_TRGSEL_TRGSEL2_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) TIOA Output of the Timer Counter Channel 1 Position  */
#define DACC_MR_TRGSEL_TRGSEL3                (DACC_MR_TRGSEL_TRGSEL3_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) TIOA Output of the Timer Counter Channel 2 Position  */
#define DACC_MR_TRGSEL_TRGSEL4                (DACC_MR_TRGSEL_TRGSEL4_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) PWM Event Line 0 Position  */
#define DACC_MR_TRGSEL_TRGSEL5                (DACC_MR_TRGSEL_TRGSEL5_Val << DACC_MR_TRGSEL_Pos)   /* (DACC_MR) PWM Event Line 1 Position  */
#define DACC_MR_WORD_Pos                      _UINT32_(4)                                          /* (DACC_MR) Word Transfer Position */
#define DACC_MR_WORD_Msk                      (_UINT32_(0x1) << DACC_MR_WORD_Pos)                  /* (DACC_MR) Word Transfer Mask */
#define DACC_MR_WORD(value)                   (DACC_MR_WORD_Msk & (_UINT32_(value) << DACC_MR_WORD_Pos)) /* Assigment of value for WORD in the DACC_MR register */
#define   DACC_MR_WORD_HALF_Val               _UINT32_(0x0)                                        /* (DACC_MR) Half-word transfer  */
#define   DACC_MR_WORD_WORD_Val               _UINT32_(0x1)                                        /* (DACC_MR) Word transfer  */
#define DACC_MR_WORD_HALF                     (DACC_MR_WORD_HALF_Val << DACC_MR_WORD_Pos)          /* (DACC_MR) Half-word transfer Position  */
#define DACC_MR_WORD_WORD                     (DACC_MR_WORD_WORD_Val << DACC_MR_WORD_Pos)          /* (DACC_MR) Word transfer Position  */
#define DACC_MR_ONE_Pos                       _UINT32_(8)                                          /* (DACC_MR) Must Be Set to 1 Position */
#define DACC_MR_ONE_Msk                       (_UINT32_(0x1) << DACC_MR_ONE_Pos)                   /* (DACC_MR) Must Be Set to 1 Mask */
#define DACC_MR_ONE(value)                    (DACC_MR_ONE_Msk & (_UINT32_(value) << DACC_MR_ONE_Pos)) /* Assigment of value for ONE in the DACC_MR register */
#define DACC_MR_USER_SEL_Pos                  _UINT32_(16)                                         /* (DACC_MR) User Channel Selection Position */
#define DACC_MR_USER_SEL_Msk                  (_UINT32_(0x3) << DACC_MR_USER_SEL_Pos)              /* (DACC_MR) User Channel Selection Mask */
#define DACC_MR_USER_SEL(value)               (DACC_MR_USER_SEL_Msk & (_UINT32_(value) << DACC_MR_USER_SEL_Pos)) /* Assigment of value for USER_SEL in the DACC_MR register */
#define   DACC_MR_USER_SEL_CHANNEL0_Val       _UINT32_(0x0)                                        /* (DACC_MR) Channel 0  */
#define   DACC_MR_USER_SEL_CHANNEL1_Val       _UINT32_(0x1)                                        /* (DACC_MR) Channel 1  */
#define   DACC_MR_USER_SEL_CHANNEL2_Val       _UINT32_(0x2)                                        /* (DACC_MR) Channel 2  */
#define DACC_MR_USER_SEL_CHANNEL0             (DACC_MR_USER_SEL_CHANNEL0_Val << DACC_MR_USER_SEL_Pos) /* (DACC_MR) Channel 0 Position  */
#define DACC_MR_USER_SEL_CHANNEL1             (DACC_MR_USER_SEL_CHANNEL1_Val << DACC_MR_USER_SEL_Pos) /* (DACC_MR) Channel 1 Position  */
#define DACC_MR_USER_SEL_CHANNEL2             (DACC_MR_USER_SEL_CHANNEL2_Val << DACC_MR_USER_SEL_Pos) /* (DACC_MR) Channel 2 Position  */
#define DACC_MR_TAG_Pos                       _UINT32_(20)                                         /* (DACC_MR) Tag Selection Mode Position */
#define DACC_MR_TAG_Msk                       (_UINT32_(0x1) << DACC_MR_TAG_Pos)                   /* (DACC_MR) Tag Selection Mode Mask */
#define DACC_MR_TAG(value)                    (DACC_MR_TAG_Msk & (_UINT32_(value) << DACC_MR_TAG_Pos)) /* Assigment of value for TAG in the DACC_MR register */
#define   DACC_MR_TAG_DIS_Val                 _UINT32_(0x0)                                        /* (DACC_MR) Tag selection mode disabled. Using USER_SEL to select the channel for the conversion.  */
#define   DACC_MR_TAG_EN_Val                  _UINT32_(0x1)                                        /* (DACC_MR) Tag selection mode enabled  */
#define DACC_MR_TAG_DIS                       (DACC_MR_TAG_DIS_Val << DACC_MR_TAG_Pos)             /* (DACC_MR) Tag selection mode disabled. Using USER_SEL to select the channel for the conversion. Position  */
#define DACC_MR_TAG_EN                        (DACC_MR_TAG_EN_Val << DACC_MR_TAG_Pos)              /* (DACC_MR) Tag selection mode enabled Position  */
#define DACC_MR_MAXS_Pos                      _UINT32_(21)                                         /* (DACC_MR) Maximum Speed Mode Position */
#define DACC_MR_MAXS_Msk                      (_UINT32_(0x1) << DACC_MR_MAXS_Pos)                  /* (DACC_MR) Maximum Speed Mode Mask */
#define DACC_MR_MAXS(value)                   (DACC_MR_MAXS_Msk & (_UINT32_(value) << DACC_MR_MAXS_Pos)) /* Assigment of value for MAXS in the DACC_MR register */
#define   DACC_MR_MAXS_NORMAL_Val             _UINT32_(0x0)                                        /* (DACC_MR) Normal mode  */
#define   DACC_MR_MAXS_MAXIMUM_Val            _UINT32_(0x1)                                        /* (DACC_MR) Maximum speed mode enabled  */
#define DACC_MR_MAXS_NORMAL                   (DACC_MR_MAXS_NORMAL_Val << DACC_MR_MAXS_Pos)        /* (DACC_MR) Normal mode Position  */
#define DACC_MR_MAXS_MAXIMUM                  (DACC_MR_MAXS_MAXIMUM_Val << DACC_MR_MAXS_Pos)       /* (DACC_MR) Maximum speed mode enabled Position  */
#define DACC_MR_CLKDIV_Pos                    _UINT32_(22)                                         /* (DACC_MR) Shall be always write at '0' Position */
#define DACC_MR_CLKDIV_Msk                    (_UINT32_(0x1) << DACC_MR_CLKDIV_Pos)                /* (DACC_MR) Shall be always write at '0' Mask */
#define DACC_MR_CLKDIV(value)                 (DACC_MR_CLKDIV_Msk & (_UINT32_(value) << DACC_MR_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the DACC_MR register */
#define DACC_MR_STARTUP_Pos                   _UINT32_(24)                                         /* (DACC_MR) Startup Time Selection Position */
#define DACC_MR_STARTUP_Msk                   (_UINT32_(0x3F) << DACC_MR_STARTUP_Pos)              /* (DACC_MR) Startup Time Selection Mask */
#define DACC_MR_STARTUP(value)                (DACC_MR_STARTUP_Msk & (_UINT32_(value) << DACC_MR_STARTUP_Pos)) /* Assigment of value for STARTUP in the DACC_MR register */
#define   DACC_MR_STARTUP_0_Val               _UINT32_(0x0)                                        /* (DACC_MR) 0 periods of peripheral clock  */
#define   DACC_MR_STARTUP_8_Val               _UINT32_(0x1)                                        /* (DACC_MR) 8 periods of peripheral clock  */
#define   DACC_MR_STARTUP_16_Val              _UINT32_(0x2)                                        /* (DACC_MR) 16 periods of peripheral clock  */
#define   DACC_MR_STARTUP_24_Val              _UINT32_(0x3)                                        /* (DACC_MR) 24 periods of peripheral clock  */
#define   DACC_MR_STARTUP_64_Val              _UINT32_(0x4)                                        /* (DACC_MR) 64 periods of peripheral clock  */
#define   DACC_MR_STARTUP_80_Val              _UINT32_(0x5)                                        /* (DACC_MR) 80 periods of peripheral clock  */
#define   DACC_MR_STARTUP_96_Val              _UINT32_(0x6)                                        /* (DACC_MR) 96 periods of peripheral clock  */
#define   DACC_MR_STARTUP_112_Val             _UINT32_(0x7)                                        /* (DACC_MR) 112 periods of peripheral clock  */
#define   DACC_MR_STARTUP_512_Val             _UINT32_(0x8)                                        /* (DACC_MR) 512 periods of peripheral clock  */
#define   DACC_MR_STARTUP_576_Val             _UINT32_(0x9)                                        /* (DACC_MR) 576 periods of peripheral clock  */
#define   DACC_MR_STARTUP_640_Val             _UINT32_(0xA)                                        /* (DACC_MR) 640 periods of peripheral clock  */
#define   DACC_MR_STARTUP_704_Val             _UINT32_(0xB)                                        /* (DACC_MR) 704 periods of peripheral clock  */
#define   DACC_MR_STARTUP_768_Val             _UINT32_(0xC)                                        /* (DACC_MR) 768 periods of peripheral clock  */
#define   DACC_MR_STARTUP_832_Val             _UINT32_(0xD)                                        /* (DACC_MR) 832 periods of peripheral clock  */
#define   DACC_MR_STARTUP_896_Val             _UINT32_(0xE)                                        /* (DACC_MR) 896 periods of peripheral clock  */
#define   DACC_MR_STARTUP_960_Val             _UINT32_(0xF)                                        /* (DACC_MR) 960 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1024_Val            _UINT32_(0x10)                                       /* (DACC_MR) 1024 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1088_Val            _UINT32_(0x11)                                       /* (DACC_MR) 1088 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1152_Val            _UINT32_(0x12)                                       /* (DACC_MR) 1152 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1216_Val            _UINT32_(0x13)                                       /* (DACC_MR) 1216 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1280_Val            _UINT32_(0x14)                                       /* (DACC_MR) 1280 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1344_Val            _UINT32_(0x15)                                       /* (DACC_MR) 1344 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1408_Val            _UINT32_(0x16)                                       /* (DACC_MR) 1408 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1472_Val            _UINT32_(0x17)                                       /* (DACC_MR) 1472 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1536_Val            _UINT32_(0x18)                                       /* (DACC_MR) 1536 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1600_Val            _UINT32_(0x19)                                       /* (DACC_MR) 1600 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1664_Val            _UINT32_(0x1A)                                       /* (DACC_MR) 1664 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1728_Val            _UINT32_(0x1B)                                       /* (DACC_MR) 1728 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1792_Val            _UINT32_(0x1C)                                       /* (DACC_MR) 1792 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1856_Val            _UINT32_(0x1D)                                       /* (DACC_MR) 1856 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1920_Val            _UINT32_(0x1E)                                       /* (DACC_MR) 1920 periods of peripheral clock  */
#define   DACC_MR_STARTUP_1984_Val            _UINT32_(0x1F)                                       /* (DACC_MR) 1984 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2048_Val            _UINT32_(0x20)                                       /* (DACC_MR) 2048 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2112_Val            _UINT32_(0x21)                                       /* (DACC_MR) 2112 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2176_Val            _UINT32_(0x22)                                       /* (DACC_MR) 2176 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2240_Val            _UINT32_(0x23)                                       /* (DACC_MR) 2240 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2304_Val            _UINT32_(0x24)                                       /* (DACC_MR) 2304 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2368_Val            _UINT32_(0x25)                                       /* (DACC_MR) 2368 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2432_Val            _UINT32_(0x26)                                       /* (DACC_MR) 2432 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2496_Val            _UINT32_(0x27)                                       /* (DACC_MR) 2496 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2560_Val            _UINT32_(0x28)                                       /* (DACC_MR) 2560 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2624_Val            _UINT32_(0x29)                                       /* (DACC_MR) 2624 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2688_Val            _UINT32_(0x2A)                                       /* (DACC_MR) 2688 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2752_Val            _UINT32_(0x2B)                                       /* (DACC_MR) 2752 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2816_Val            _UINT32_(0x2C)                                       /* (DACC_MR) 2816 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2880_Val            _UINT32_(0x2D)                                       /* (DACC_MR) 2880 periods of peripheral clock  */
#define   DACC_MR_STARTUP_2944_Val            _UINT32_(0x2E)                                       /* (DACC_MR) 2944 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3008_Val            _UINT32_(0x2F)                                       /* (DACC_MR) 3008 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3072_Val            _UINT32_(0x30)                                       /* (DACC_MR) 3072 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3136_Val            _UINT32_(0x31)                                       /* (DACC_MR) 3136 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3200_Val            _UINT32_(0x32)                                       /* (DACC_MR) 3200 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3264_Val            _UINT32_(0x33)                                       /* (DACC_MR) 3264 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3328_Val            _UINT32_(0x34)                                       /* (DACC_MR) 3328 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3392_Val            _UINT32_(0x35)                                       /* (DACC_MR) 3392 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3456_Val            _UINT32_(0x36)                                       /* (DACC_MR) 3456 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3520_Val            _UINT32_(0x37)                                       /* (DACC_MR) 3520 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3584_Val            _UINT32_(0x38)                                       /* (DACC_MR) 3584 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3648_Val            _UINT32_(0x39)                                       /* (DACC_MR) 3648 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3712_Val            _UINT32_(0x3A)                                       /* (DACC_MR) 3712 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3776_Val            _UINT32_(0x3B)                                       /* (DACC_MR) 3776 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3840_Val            _UINT32_(0x3C)                                       /* (DACC_MR) 3840 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3904_Val            _UINT32_(0x3D)                                       /* (DACC_MR) 3904 periods of peripheral clock  */
#define   DACC_MR_STARTUP_3968_Val            _UINT32_(0x3E)                                       /* (DACC_MR) 3968 periods of peripheral clock  */
#define   DACC_MR_STARTUP_4032_Val            _UINT32_(0x3F)                                       /* (DACC_MR) 4032 periods of peripheral clock  */
#define DACC_MR_STARTUP_0                     (DACC_MR_STARTUP_0_Val << DACC_MR_STARTUP_Pos)       /* (DACC_MR) 0 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_8                     (DACC_MR_STARTUP_8_Val << DACC_MR_STARTUP_Pos)       /* (DACC_MR) 8 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_16                    (DACC_MR_STARTUP_16_Val << DACC_MR_STARTUP_Pos)      /* (DACC_MR) 16 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_24                    (DACC_MR_STARTUP_24_Val << DACC_MR_STARTUP_Pos)      /* (DACC_MR) 24 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_64                    (DACC_MR_STARTUP_64_Val << DACC_MR_STARTUP_Pos)      /* (DACC_MR) 64 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_80                    (DACC_MR_STARTUP_80_Val << DACC_MR_STARTUP_Pos)      /* (DACC_MR) 80 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_96                    (DACC_MR_STARTUP_96_Val << DACC_MR_STARTUP_Pos)      /* (DACC_MR) 96 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_112                   (DACC_MR_STARTUP_112_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 112 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_512                   (DACC_MR_STARTUP_512_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 512 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_576                   (DACC_MR_STARTUP_576_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 576 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_640                   (DACC_MR_STARTUP_640_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 640 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_704                   (DACC_MR_STARTUP_704_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 704 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_768                   (DACC_MR_STARTUP_768_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 768 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_832                   (DACC_MR_STARTUP_832_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 832 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_896                   (DACC_MR_STARTUP_896_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 896 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_960                   (DACC_MR_STARTUP_960_Val << DACC_MR_STARTUP_Pos)     /* (DACC_MR) 960 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1024                  (DACC_MR_STARTUP_1024_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1024 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1088                  (DACC_MR_STARTUP_1088_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1088 periods of peripheral clock Position  */
