Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/dacc.h
#define DACC_MR_STARTUP_1152                  (DACC_MR_STARTUP_1152_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1152 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1216                  (DACC_MR_STARTUP_1216_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1216 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1280                  (DACC_MR_STARTUP_1280_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1280 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1344                  (DACC_MR_STARTUP_1344_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1344 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1408                  (DACC_MR_STARTUP_1408_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1408 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1472                  (DACC_MR_STARTUP_1472_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1472 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1536                  (DACC_MR_STARTUP_1536_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1536 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1600                  (DACC_MR_STARTUP_1600_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1600 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1664                  (DACC_MR_STARTUP_1664_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1664 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1728                  (DACC_MR_STARTUP_1728_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1728 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1792                  (DACC_MR_STARTUP_1792_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1792 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1856                  (DACC_MR_STARTUP_1856_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1856 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1920                  (DACC_MR_STARTUP_1920_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1920 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_1984                  (DACC_MR_STARTUP_1984_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 1984 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2048                  (DACC_MR_STARTUP_2048_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2048 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2112                  (DACC_MR_STARTUP_2112_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2112 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2176                  (DACC_MR_STARTUP_2176_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2176 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2240                  (DACC_MR_STARTUP_2240_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2240 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2304                  (DACC_MR_STARTUP_2304_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2304 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2368                  (DACC_MR_STARTUP_2368_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2368 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2432                  (DACC_MR_STARTUP_2432_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2432 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2496                  (DACC_MR_STARTUP_2496_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2496 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2560                  (DACC_MR_STARTUP_2560_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2560 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2624                  (DACC_MR_STARTUP_2624_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2624 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2688                  (DACC_MR_STARTUP_2688_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2688 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2752                  (DACC_MR_STARTUP_2752_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2752 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2816                  (DACC_MR_STARTUP_2816_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2816 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2880                  (DACC_MR_STARTUP_2880_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2880 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_2944                  (DACC_MR_STARTUP_2944_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 2944 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3008                  (DACC_MR_STARTUP_3008_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3008 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3072                  (DACC_MR_STARTUP_3072_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3072 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3136                  (DACC_MR_STARTUP_3136_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3136 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3200                  (DACC_MR_STARTUP_3200_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3200 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3264                  (DACC_MR_STARTUP_3264_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3264 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3328                  (DACC_MR_STARTUP_3328_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3328 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3392                  (DACC_MR_STARTUP_3392_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3392 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3456                  (DACC_MR_STARTUP_3456_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3456 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3520                  (DACC_MR_STARTUP_3520_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3520 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3584                  (DACC_MR_STARTUP_3584_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3584 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3648                  (DACC_MR_STARTUP_3648_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3648 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3712                  (DACC_MR_STARTUP_3712_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3712 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3776                  (DACC_MR_STARTUP_3776_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3776 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3840                  (DACC_MR_STARTUP_3840_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3840 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3904                  (DACC_MR_STARTUP_3904_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3904 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_3968                  (DACC_MR_STARTUP_3968_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 3968 periods of peripheral clock Position  */
#define DACC_MR_STARTUP_4032                  (DACC_MR_STARTUP_4032_Val << DACC_MR_STARTUP_Pos)    /* (DACC_MR) 4032 periods of peripheral clock Position  */
#define DACC_MR_Msk                           _UINT32_(0x3F73011F)                                 /* (DACC_MR) Register Mask  */


