Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/dacc.h
/* -------- DACC_CHER : (DACC Offset: 0x10) ( /W 32) Channel Enable Register -------- */
#define DACC_CHER_CH0_Pos                     _UINT32_(0)                                          /* (DACC_CHER) Channel 0 Enable Position */
#define DACC_CHER_CH0_Msk                     (_UINT32_(0x1) << DACC_CHER_CH0_Pos)                 /* (DACC_CHER) Channel 0 Enable Mask */
#define DACC_CHER_CH0(value)                  (DACC_CHER_CH0_Msk & (_UINT32_(value) << DACC_CHER_CH0_Pos)) /* Assigment of value for CH0 in the DACC_CHER register */
#define DACC_CHER_CH1_Pos                     _UINT32_(1)                                          /* (DACC_CHER) Channel 1 Enable Position */
#define DACC_CHER_CH1_Msk                     (_UINT32_(0x1) << DACC_CHER_CH1_Pos)                 /* (DACC_CHER) Channel 1 Enable Mask */
#define DACC_CHER_CH1(value)                  (DACC_CHER_CH1_Msk & (_UINT32_(value) << DACC_CHER_CH1_Pos)) /* Assigment of value for CH1 in the DACC_CHER register */
#define DACC_CHER_CH2_Pos                     _UINT32_(2)                                          /* (DACC_CHER) Channel 2 Enable Position */
#define DACC_CHER_CH2_Msk                     (_UINT32_(0x1) << DACC_CHER_CH2_Pos)                 /* (DACC_CHER) Channel 2 Enable Mask */
#define DACC_CHER_CH2(value)                  (DACC_CHER_CH2_Msk & (_UINT32_(value) << DACC_CHER_CH2_Pos)) /* Assigment of value for CH2 in the DACC_CHER register */
#define DACC_CHER_Msk                         _UINT32_(0x00000007)                                 /* (DACC_CHER) Register Mask  */

#define DACC_CHER_CH_Pos                      _UINT32_(0)                                          /* (DACC_CHER Position) Channel 2 Enable */
#define DACC_CHER_CH_Msk                      (_UINT32_(0x7) << DACC_CHER_CH_Pos)                  /* (DACC_CHER Mask) CH */
#define DACC_CHER_CH(value)                   (DACC_CHER_CH_Msk & (_UINT32_(value) << DACC_CHER_CH_Pos)) 

/* -------- DACC_CHDR : (DACC Offset: 0x14) ( /W 32) Channel Disable Register -------- */
#define DACC_CHDR_CH0_Pos                     _UINT32_(0)                                          /* (DACC_CHDR) Channel 0 Disable Position */
#define DACC_CHDR_CH0_Msk                     (_UINT32_(0x1) << DACC_CHDR_CH0_Pos)                 /* (DACC_CHDR) Channel 0 Disable Mask */
#define DACC_CHDR_CH0(value)                  (DACC_CHDR_CH0_Msk & (_UINT32_(value) << DACC_CHDR_CH0_Pos)) /* Assigment of value for CH0 in the DACC_CHDR register */
#define DACC_CHDR_CH1_Pos                     _UINT32_(1)                                          /* (DACC_CHDR) Channel 1 Disable Position */
#define DACC_CHDR_CH1_Msk                     (_UINT32_(0x1) << DACC_CHDR_CH1_Pos)                 /* (DACC_CHDR) Channel 1 Disable Mask */
#define DACC_CHDR_CH1(value)                  (DACC_CHDR_CH1_Msk & (_UINT32_(value) << DACC_CHDR_CH1_Pos)) /* Assigment of value for CH1 in the DACC_CHDR register */
#define DACC_CHDR_CH2_Pos                     _UINT32_(2)                                          /* (DACC_CHDR) Channel 2 Disable Position */
#define DACC_CHDR_CH2_Msk                     (_UINT32_(0x1) << DACC_CHDR_CH2_Pos)                 /* (DACC_CHDR) Channel 2 Disable Mask */
#define DACC_CHDR_CH2(value)                  (DACC_CHDR_CH2_Msk & (_UINT32_(value) << DACC_CHDR_CH2_Pos)) /* Assigment of value for CH2 in the DACC_CHDR register */
#define DACC_CHDR_Msk                         _UINT32_(0x00000007)                                 /* (DACC_CHDR) Register Mask  */

#define DACC_CHDR_CH_Pos                      _UINT32_(0)                                          /* (DACC_CHDR Position) Channel 2 Disable */
#define DACC_CHDR_CH_Msk                      (_UINT32_(0x7) << DACC_CHDR_CH_Pos)                  /* (DACC_CHDR Mask) CH */
#define DACC_CHDR_CH(value)                   (DACC_CHDR_CH_Msk & (_UINT32_(value) << DACC_CHDR_CH_Pos)) 

/* -------- DACC_CHSR : (DACC Offset: 0x18) ( R/ 32) Channel Status Register -------- */
#define DACC_CHSR_CH0_Pos                     _UINT32_(0)                                          /* (DACC_CHSR) Channel 0 Status Position */
#define DACC_CHSR_CH0_Msk                     (_UINT32_(0x1) << DACC_CHSR_CH0_Pos)                 /* (DACC_CHSR) Channel 0 Status Mask */
#define DACC_CHSR_CH0(value)                  (DACC_CHSR_CH0_Msk & (_UINT32_(value) << DACC_CHSR_CH0_Pos)) /* Assigment of value for CH0 in the DACC_CHSR register */
#define DACC_CHSR_CH1_Pos                     _UINT32_(1)                                          /* (DACC_CHSR) Channel 1 Status Position */
#define DACC_CHSR_CH1_Msk                     (_UINT32_(0x1) << DACC_CHSR_CH1_Pos)                 /* (DACC_CHSR) Channel 1 Status Mask */
#define DACC_CHSR_CH1(value)                  (DACC_CHSR_CH1_Msk & (_UINT32_(value) << DACC_CHSR_CH1_Pos)) /* Assigment of value for CH1 in the DACC_CHSR register */
#define DACC_CHSR_CH2_Pos                     _UINT32_(2)                                          /* (DACC_CHSR) Channel 2 Status Position */
#define DACC_CHSR_CH2_Msk                     (_UINT32_(0x1) << DACC_CHSR_CH2_Pos)                 /* (DACC_CHSR) Channel 2 Status Mask */
#define DACC_CHSR_CH2(value)                  (DACC_CHSR_CH2_Msk & (_UINT32_(value) << DACC_CHSR_CH2_Pos)) /* Assigment of value for CH2 in the DACC_CHSR register */
#define DACC_CHSR_Msk                         _UINT32_(0x00000007)                                 /* (DACC_CHSR) Register Mask  */

#define DACC_CHSR_CH_Pos                      _UINT32_(0)                                          /* (DACC_CHSR Position) Channel 2 Status */
#define DACC_CHSR_CH_Msk                      (_UINT32_(0x7) << DACC_CHSR_CH_Pos)                  /* (DACC_CHSR Mask) CH */
#define DACC_CHSR_CH(value)                   (DACC_CHSR_CH_Msk & (_UINT32_(value) << DACC_CHSR_CH_Pos)) 

/* -------- DACC_CDR : (DACC Offset: 0x20) ( /W 32) Conversion Data Register -------- */
#define DACC_CDR_DATA_Pos                     _UINT32_(0)                                          /* (DACC_CDR) Data to Convert Position */
#define DACC_CDR_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << DACC_CDR_DATA_Pos)          /* (DACC_CDR) Data to Convert Mask */
#define DACC_CDR_DATA(value)                  (DACC_CDR_DATA_Msk & (_UINT32_(value) << DACC_CDR_DATA_Pos)) /* Assigment of value for DATA in the DACC_CDR register */
#define DACC_CDR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (DACC_CDR) Register Mask  */


/* -------- DACC_IER : (DACC Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define DACC_IER_TXRDY_Pos                    _UINT32_(0)                                          /* (DACC_IER) Transmit Ready Interrupt Enable Position */
#define DACC_IER_TXRDY_Msk                    (_UINT32_(0x1) << DACC_IER_TXRDY_Pos)                /* (DACC_IER) Transmit Ready Interrupt Enable Mask */
#define DACC_IER_TXRDY(value)                 (DACC_IER_TXRDY_Msk & (_UINT32_(value) << DACC_IER_TXRDY_Pos)) /* Assigment of value for TXRDY in the DACC_IER register */
#define DACC_IER_EOC_Pos                      _UINT32_(1)                                          /* (DACC_IER) End of Conversion Interrupt Enable Position */
#define DACC_IER_EOC_Msk                      (_UINT32_(0x1) << DACC_IER_EOC_Pos)                  /* (DACC_IER) End of Conversion Interrupt Enable Mask */
#define DACC_IER_EOC(value)                   (DACC_IER_EOC_Msk & (_UINT32_(value) << DACC_IER_EOC_Pos)) /* Assigment of value for EOC in the DACC_IER register */
#define DACC_IER_Msk                          _UINT32_(0x00000003)                                 /* (DACC_IER) Register Mask  */


